In [105]:
import numpy as np
import pandas as pd

In [106]:
index=[['a','a','a','b','b','b','c','c','d','d'],#lvl1 indexing
      [1,2,3,1,2,3,1,2,1,2]] #lvl2 indexing ,these are user defined can be anything

ser=pd.Series(np.random.randn(10),index=index)
ser

a  1    0.851046
   2   -0.220849
   3    0.830255
b  1    1.687381
   2   -1.603784
   3   -0.270801
c  1    0.673514
   2    1.035825
d  1   -0.393358
   2   -1.963088
dtype: float64

In [107]:
ser['a']

1    0.851046
2   -0.220849
3    0.830255
dtype: float64

In [108]:
ser['a'][2]

-0.22084865288757088

In [109]:
df=pd.DataFrame(np.arange(12).reshape((4,3)),
                index=[['a','a','b','b'],[1,2,1,2]], #these are two levels of indexing
                columns=['AB','ON','AC'])
df

     AB  ON  AC
a 1   0   1   2
  2   3   4   5
b 1   6   7   8
  2   9  10  11

In [110]:
df['ON']

a  1     1
   2     4
b  1     7
   2    10
Name: ON, dtype: int64

In [111]:
df.loc['a']

   AB  ON  AC
1   0   1   2
2   3   4   5

In [112]:
df.loc['a'].loc[2]

AB    3
ON    4
AC    5
Name: 2, dtype: int64

In [113]:
df.loc['a'].loc[2]['AB']

3

In [114]:
df.index.names=['L_1','L_2']
df

         AB  ON  AC
L_1 L_2
a   1     0   1   2
    2     3   4   5
b   1     6   7   8
    2     9  10  11

In [115]:
#returns a cross_section (row(s) or column(s) from the Series/DataFrame)

df.xs('a')

     AB  ON  AC
L_2
1     0   1   2
2     3   4   5

In [116]:
#if we wanna grab all the data from df where index L_2 is "1", its tricky for loc method,xs will do the magic here

df.xs(1,level='L_2')